# 要素の変更

a = [1, 2, 3]
p a[-3]
# a[-4] = 10
# p a[-4]

# ------------------------------
b = [1, 2, 3, 4, 5]
p "size:#{b.size}"
# 2つめから3要素を100で置き換える
# サイズが変わる
b[1, 3] = 100
p b
p "size:#{b.size}"

# -----------------------------
# <<以外にもpushで配列の要素を追加できる
c = []
c.push(1)
p "c = #{c}"

c.push(2, 3)
p "c = #{c}"

# -----------------------------
# deleteメソッドで、値が2のものを削除
d = [1, 2, 3, 4, 5]
p "size = #{d.size}"
d.delete(2)
p "d = #{d}"
p "size = #{d.size}"

# 存在しない値を指定するとnil
d.delete(9)
p "d = #{d}"
p "size = #{d.size}"
